from typing import Any

import pytest
from pandas import DataFrame

from src.operation import find_category_df, find_line, find_top_transactions, info_from_operation


@pytest.fixture
def data() -> list[dict]:
    return [
        {
            "Дата операции": "08.01.2018 13:38:08",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1004.9,
            "Валюта операции": "RUB",
            "Сумма платежа": -1004.9,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Различные товары",
            "MCC": 5311,
            "Описание": "Torgovyy Dom Mayak",
            "Бонусы (включая кэшбэк)": 20,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1004.9,
        },
        {
            "Дата операции": "05.01.2018 15:28:22",
            "Дата платежа": "07.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -79.6,
            "Валюта операции": "RUB",
            "Сумма платежа": -79.6,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Пятёрочка",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 79.6,
        },
        {
            "Дата операции": "05.01.2018 14:58:38",
            "Дата платежа": "07.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -120.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -120.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Цветы",
            "MCC": 5992,
            "Описание": "Magazin  Prestizh",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 120.0,
        },
        {
            "Дата операции": "04.01.2018 15:00:41",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1025.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1025.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Топливо",
            "MCC": 5541,
            "Описание": "Pskov AZS 12 K2",
            "Бонусы (включая кэшбэк)": 20,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1025.0,
        },
        {
            "Дата операции": "04.01.2018 14:05:08",
            "Дата платежа": "06.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1065.9,
            "Валюта операции": "RUB",
            "Сумма платежа": -1065.9,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Пятёрочка",
            "Бонусы (включая кэшбэк)": 21,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1065.9,
        },
        {
            "Дата операции": "03.01.2018 15:03:35",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -73.06,
            "Валюта операции": "RUB",
            "Сумма платежа": -73.06,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Супермаркеты",
            "MCC": 5499,
            "Описание": "Magazin 25",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 73.06,
        },
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -21.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -21.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Красота",
            "MCC": 5977,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0,
        },
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -316.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -316.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Красота",
            "MCC": 5977,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 316.0,
        },
        {
            "Дата операции": "01.01.2018 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": "",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Переводы",
            "MCC": "",
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0,
        },
    ]


def test_find_line(data: list[dict]) -> None:
    correct = [
        {
            "Дата операции": "01.01.2018 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": "",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Переводы",
            "MCC": "",
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0,
        }
    ]
    assert find_line(data, "переводы") == correct


def test_info_from_operation(data: list[dict]) -> None:
    time = "2018-01-10 12:12:12"
    assert info_from_operation(data, time) == [
        {"last_digits": "7197", "total_spent": "3705.46", "cashback": "37.0546"},
        {"last_digits": "Переводы", "total_spent": "3000.0", "cashback": "0"},
    ]


def test_find_top_transactions(data: list[dict]) -> None:
    time = "2018-01-10 12:12:12"
    correct = [
        {"amount": 3000.0, "category": "Переводы", "date": "01.01.2018", "description": "Линзомат ТЦ Юность"},
        {"amount": 1065.9, "category": "Супермаркеты", "date": "06.01.2018", "description": "Пятёрочка"},
        {"amount": 1025.0, "category": "Топливо", "date": "05.01.2018", "description": "Pskov AZS 12 K2"},
        {"amount": 1004.9, "category": "Различные товары", "date": "10.01.2018", "description": "Torgovyy Dom Mayak"},
        {"amount": 316.0, "category": "Красота", "date": "04.01.2018", "description": "OOO Balid"},
    ]
    assert find_top_transactions(data, time) == correct


def test_find_category_df(data: list[dict[Any, Any]]) -> None:
    data_df: DataFrame = DataFrame(data)
    assert find_category_df(data_df, "Переводы").to_dict("records") == [
        {
            "MCC": "",
            "Бонусы (включая кэшбэк)": 0,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "01.01.2018 12:49:53",
            "Дата платежа": "01.01.2018",
            "Категория": "Переводы",
            "Кэшбэк": "",
            "Номер карты": "",
            "Округление на инвесткопилку": 0,
            "Описание": "Линзомат ТЦ Юность",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Сумма операции с округлением": 3000.0,
            "Сумма платежа": -3000.0,
        }
    ]
